## Brian Zhang
### 1/16/2025

***

#### Returning the first 7 records from the housing table

In [3]:
%load_ext sql
%sql sqlite:///housing.db

In [5]:
%config SqlMagic.style = '_DEPRECATED_DEFAULT'

In [7]:
import pandas as pd
import sqlite3
conn_mydb = sqlite3.connect("housing.db")

In [9]:
%%sql
SELECT * FROM housing LIMIT 7;

 * sqlite:///housing.db
Done.

[(1, 'Abilene', 2000, 1, 72, 5380000, 71400, 701, 6.3),
 (2, 'Abilene', 2000, 2, 98, 6505000, 58700, 746, 6.6),
 (3, 'Abilene', 2000, 3, 130, 9285000, 58100, 784, 6.8),
 (4, 'Abilene', 2000, 4, 98, 9730000, 68600, 785, 6.9),
 (5, 'Abilene', 2000, 5, 141, 10590000, 67300, 794, 6.8),
 (6, 'Abilene', 2000, 6, 156, 13910000, 66900, 780, 6.6),
 (7, 'Abilene', 2000, 7, 152, 12635000, 73500, 742, 6.2)]

***

#### The number of records in the data had sales greater than 100 and a median sales price greater than 100000.

In [13]:
%%sql
SELECT COUNT(*) AS sales_total
FROM housing
WHERE sales > 100 AND median > 100000;

 * sqlite:///housing.db
Done.

[(5106,)]

***

#### The number of records in the data that had sales greater than 100 or a median sales price less than 100000 by month.

In [75]:
%%sql
SELECT 
    month,
    COUNT(*) AS num_records
FROM 
    housing
WHERE 
    sales > 100 OR median < 100000
GROUP BY 
    month
ORDER BY 
    month;

 * sqlite:///housing.db
Done.

[(1, 576),
 (2, 582),
 (3, 625),
 (4, 620),
 (5, 639),
 (6, 625),
 (7, 626),
 (8, 586),
 (9, 563),
 (10, 575),
 (11, 546),
 (12, 559)]

***

#### The mean annual sales by city and year, excluding cities that begin with the letter H.

In [82]:
%%sql
SELECT 
    city,
    year,
    AVG(sales) AS mean_annual_sales
FROM 
    housing
WHERE 
    city NOT LIKE 'H%' 
GROUP BY 
    city, year
ORDER BY 
    mean_annual_sales DESC
LIMIT 20;

 * sqlite:///housing.db
Done.

[('Dallas', 2006, 5352.166666666667),
 ('Dallas', 2015, 5247.857142857143),
 ('Dallas', 2014, 5012.833333333333),
 ('Dallas', 2005, 4998.333333333333),
 ('Dallas', 2013, 4976.166666666667),
 ('Dallas', 2007, 4974.583333333333),
 ('Dallas', 2004, 4542.833333333333),
 ('Dallas', 2008, 4237.333333333333),
 ('Dallas', 2012, 4200.916666666667),
 ('Dallas', 2003, 4106.5),
 ('Dallas', 2002, 3933.25),
 ('Dallas', 2001, 3916.0),
 ('Dallas', 2009, 3824.25),
 ('Dallas', 2000, 3787.1666666666665),
 ('Dallas', 2011, 3554.6666666666665),
 ('Dallas', 2010, 3531.9166666666665),
 ('Austin', 2015, 2696.8571428571427),
 ('Austin', 2014, 2579.4166666666665),
 ('Austin', 2013, 2536.3333333333335),
 ('Austin', 2006, 2523.6666666666665)]

***

#### Sales in Austin in December 2010?

In [15]:
%%sql
SELECT 
    city,
    year,
    sales
FROM 
    housing
WHERE 
    city = 'Austin' 
    AND year = 2010 AND month = 12;

 * sqlite:///housing.db
Done.

[('Austin', 2010, 1561)]

***

#### In 2010 in Austin, the month that had the most sales?

In [104]:
%%sql
SELECT 
    month,
    sales
FROM 
    housing
WHERE 
    city = "Austin" 
    AND year = 2010
ORDER BY 
    sales DESC
LIMIT 1;

 * sqlite:///housing.db
Done.

[(5, 2286)]

***

#### The result that contains the top five citiesâ€™ sales and the month it took place in 2010, excluding Austin

In [110]:
%%sql
SELECT 
    city,
    month,
    sales
FROM 
    housing
WHERE 
    city != 'Austin' 
    AND year = 2010
ORDER BY 
    sales DESC
LIMIT 5;

 * sqlite:///housing.db
Done.

[('Houston', 5, 6335),
 ('Houston', 6, 6117),
 ('Houston', 4, 5932),
 ('Houston', 3, 5389),
 ('Dallas', 5, 4891)]

***

#### City, year, and month in which the fewest sales took place.

In [116]:
%%sql
SELECT 
    sales AS fewest_sales,
    city,
    year,
    month
FROM 
    housing
ORDER BY 
    sales ASC
LIMIT 1;

 * sqlite:///housing.db
Done.

[(6, 'San Marcos', 2011, 10)]

***

#### Mean sales in each year.

In [120]:
%%sql
SELECT 
    year,
    AVG(sales) AS mean_sales
FROM 
    housing
GROUP BY 
    year
ORDER BY 
    year;

 * sqlite:///housing.db
Done.

[(2000, 403.04891304347825),
 (2001, 419.29891304347825),
 (2002, 425.0),
 (2003, 459.9800724637681),
 (2004, 514.4909420289855),
 (2005, 572.5471014492754),
 (2006, 629.9510869565217),
 (2007, 593.661231884058),
 (2008, 501.2028985507246),
 (2009, 462.4166666666667),
 (2010, 440.2427536231884),
 (2011, 446.2971014492754),
 (2012, 520.0217391304348),
 (2013, 607.054347826087),
 (2014, 626.304347826087),
 (2015, 646.3478260869565)]

***

#### the years that had mean sales greater than 600.

In [124]:
%%sql
SELECT 
    year,
    AVG(sales) AS mean_sales
FROM 
    housing
GROUP BY 
    year
HAVING 
    AVG(sales) > 600
ORDER BY 
    year;

 * sqlite:///housing.db
Done.

[(2006, 629.9510869565217),
 (2013, 607.054347826087),
 (2014, 626.304347826087),
 (2015, 646.3478260869565)]